src/cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CLIENT_DE_PASSAGE</name>
      <description>CLIENT DE PASSAGE</description>
    </items>
    <items>
      <name>Migration</name>
      <description>Migration</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКПрефиксуМесяцОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодДеятельности</name>
    <type>
      <types>CatalogRef.РодыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьНакладнойЦеныБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйКабинетПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧГрафикДоставок</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЛогиста</name>
      <type>
        <types>DefinedType.КомментарийКороткий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Уникальный идентификатор пользователя информационной базы</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходВПрограммуРазрешен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роли</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтображатьОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/Контрагенты/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ДатаРегистрации = ТекущаяДатаСеанса();
	//Наименование = НСтр("fr = 'Nouveau'; ru = 'Новый'; en = 'New'; es = 'Nuevo'");
	Категория = Константы.КатегорияКлиентаПоУмолчанию.Получить();
	ТипЦены = Константы.ТипЦенПоУмолчанию.Получить();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательСсылка = Справочники.Пользователи.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПользовательСсылка = ВыборкаДетальныеЗаписи.Ссылка;		
	КонецЦикла;
	
	Если ЭтотОбъект.ЛичныйКабинетПартнера Тогда  
		Если ПользовательСсылка.Пустая() Тогда  
			//создаем пользователя      
			
			Если СокрЛП(ЭтотОбъект.Логин) <> "" Тогда
		    	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		        НовыйПользователь.Имя = ЭтотОбъект.Логин;
		        НовыйПользователь.Пароль = ЭтотОбъект.Пароль;
		        НовыйПользователь.ПолноеИмя = ЭтотОбъект.Наименование; 
				НовыйПользователь.Роли.Добавить(Метаданные.Роли.ЛичныйКабинет);      
		        НовыйПользователь.ПоказыватьВСпискеВыбора = Ложь;   
		        НовыйПользователь.Записать();
				
				СпрПол = Справочники.Пользователи.СоздатьЭлемент();    
				СпрПол.ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор;
				СпрПол.Наименование = ЭтотОбъект.Логин;
				СпрПол.Контрагент = ЭтотОбъект.Ссылка;
				СпрПол.ВходВПрограммуРазрешен = Истина;
				СпрПол.ПолноеИмя = ЭтотОбъект.Наименование;
				СпрПол.Роли = "ЛичныйКабинет";
				СпрПол.Записать();    
			КонецЕсли;
			
		Иначе
			//обновляем пользователя              
			Если СокрЛП(ЭтотОбъект.Логин) <> "" Тогда
		    	НовыйПользователь=ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПользовательСсылка.ИдентификаторПользователяИБ);
		        НовыйПользователь.Имя = ЭтотОбъект.Логин;    
				Если СокрЛП(ЭтотОбъект.Пароль) <> "" Тогда
		        	НовыйПользователь.Пароль = ЭтотОбъект.Пароль; 
				КонецЕсли;
		  	    НовыйПользователь.Записать();	
			КонецЕсли;
					
			СпрПол = ПользовательСсылка.ПолучитьОбъект(); 
	        СпрПол.ВходВПрограммуРазрешен = Истина; 
			СпрПол.Записать();			
		КонецЕсли;           
	Иначе	
		Если НЕ ПользовательСсылка.Пустая() Тогда  
			//обновляем пользователя  
			Если СокрЛП(ЭтотОбъект.Логин) <> "" Тогда
	    		НовыйПользователь=ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПользовательСсылка.ИдентификаторПользователяИБ);
		        НовыйПользователь.Имя = ЭтотОбъект.Логин;       
				Если СокрЛП(ЭтотОбъект.Пароль) <> "" Тогда
		        	НовыйПользователь.Пароль = ЭтотОбъект.Пароль;
				КонецЕсли;
		  	    НовыйПользователь.Записать();	
			КонецЕсли;
						
			СпрПол = ПользовательСсылка.ПолучитьОбъект();  
	        СпрПол.ВходВПрограммуРазрешен = Ложь; 
			СпрПол.Записать();
		КонецЕсли;           		
	КонецЕсли;                                   
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() Тогда 
		Автор = ПараметрыСеанса.Пользователь;   
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//Если Не ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЧастноеЛицо Тогда 
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("CIN"));
	//КонецЕсли;
	Если Не ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо Тогда 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ICE"));
	КонецЕсли; 
КонецПроцедуры
